<script setup name="site"></script>

<template>
  <div>
    <h4>这里是Home的子页面</h4>
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
    其实每一个生命周期和我们对应的class状态基本上是一个意思，但是有的时候class满足不了，我们就可以写到生命周期上，如果说有些场景css满足不了，需要使用js去计算，这样我们就可以写进生命周期里面
  </div>
</template>

<style scoped lang="scss"></style>
